RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
//the fast buffer is RAM and used to transfer data quickly from the camera callback to the slow, SPIRAM buffer. 
//Writing directly to the SPIRAM buffer is too slow in the camera callback and causes lost frames, so I use this RAM buffer and a separate task (sd_enqueue_task) for that.
static constexpr size_t SD_FAST_BUFFER_SIZE = 8192;
Circular_Buffer s_sd_fast_buffer((uint8_t*)heap_caps_malloc(SD_FAST_BUFFER_SIZE, MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL), SD_FAST_BUFFER_SIZE);

//this slow buffer is used to buffer data that is about to be written to SD. The reason it's this big is because SD card write speed fluctuated a lot and 
// sometimes it pauses for a few hundred ms. So to avoid lost data, I have to buffer it into a big enough buffer.
//The data is written to the sd card by the sd_write_task, in chunks of SD_WRITE_BLOCK_SIZE.
static constexpr size_t SD_SLOW_BUFFER_SIZE_PSRAM = 3 * 1024 * 1024;
Circular_Buffer* s_sd_slow_buffer = NULL;

//Cannot write to SD directly from the slow, SPIRAM buffer as that causes the write speed to plummet. So instead I read from the slow buffer into
// this RAM block and write from it directly. This results in several MB/s write speed performance which is good enough.
//ESP32S3: 2048  - ~1.2 MB/s
//ESP32S3: 6*512 - ~1.5 MB/s
//ESP32S3: 4096  - ~1.4...1.8 MB/s 
//ESP32S3: 10*512- ~1.9 MB/s
//ESP32S3: 8192  - 1.9...2.5 MB/s
//ESP32S3: 20*512- ~2.5 MB/s
//ESP32S3: 4096 SPI RAM - 0.38 MB/s

//ESP32 2096: 0.9 MB/s
//ESP32 6*512:1 MB/s
//ESP32 4096: 1.6 MB/s 
//ESP32 12*512:1.5 MB/s  ???
//ESP32 8192: 1.9 MB/s

//ESP32 8192 SPI mode file test: 1.1MB/sec
static constexpr size_t SD_WRITE_BLOCK_SIZE = 8192;

//for fast SD writes, buffer has to be in DMA enabled memory
static uint8_t* sd_write_block = (uint8_t*)heap_caps_malloc(SD_WRITE_BLOCK_SIZE, MALLOC_CAP_DMA);


//=============================================================================================
//=============================================================================================
void run_file_benchmark()
{
    LOG("Starting file benchmark\n");

    const char* filename = "/sdcard/bench.bin";
    FILE* file = fopen(filename, "wb");
    if (!file) 
    {
        LOG("Error: Cannot open file %s\n", filename);
        return;
    }

    const size_t CHUNK_SIZE = 8 * 1024; // 8 KB
    const size_t TOTAL_SIZE = 100 * 1024 * 1024; // 100 MB
    size_t written = 0;
    uint8_t* buffer = (uint8_t*)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_DMA);
    //uint8_t* buffer2 = (uint8_t*)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM);
    if (!buffer) 
    {
        LOG("Error: Cannot allocate buffer\n");
        fclose(file);
        return;
    }

    // Fill buffer with a pattern for identification
    memset(buffer, 0xAA, CHUNK_SIZE);

    int64_t start_time = esp_timer_get_time();
    int64_t last_yield_time = start_time;

    while (written < TOTAL_SIZE) {
        size_t to_write = CHUNK_SIZE;
        if (written + to_write > TOTAL_SIZE) {
            to_write = TOTAL_SIZE - written;
        }

        //memcpy(buffer, buffer2, to_write);

        size_t result = fwrite(buffer, 1, to_write, file);
        if (result != to_write) {
            LOG("Error: fwrite failed, wrote %lu instead of %lu\n", result, to_write);
            break;
        }

        written += result;

        // Flush to ensure data is written
        fflush(file);

        // Calculate progress (using integer arithmetic for compatibility)
        int64_t current_time = esp_timer_get_time();
        int64_t elapsed_micros = current_time - start_time;
        size_t mb = written / (1024ULL * 1024ULL);
        size_t percent = (written * 100ULL) / TOTAL_SIZE;
        size_t seconds = elapsed_micros / 1000000ULL;
        size_t tenth_second = (elapsed_micros / 100000ULL) % 10ULL;

        double speed_bps = written / (elapsed_micros / 1000000.0);
        size_t speed_kb = (size_t)(speed_bps / 1024.0);

        // Check if 100ms have passed since last yield
        int64_t now = esp_timer_get_time();
        if (now - last_yield_time > 100000) 
        { // 100ms in microseconds
            vTaskDelay(1); // minimal yield
            last_yield_time = now;

            char logbuf[256];
            sprintf(logbuf, "Progress: %lu MB (%lu%%) written in %lu.%lu seconds. Speed: %lu KB/s\n",
                    (unsigned long)mb, (unsigned long)percent, (unsigned long)seconds, (unsigned long)tenth_second, (unsigned long)speed_kb);
            LOG("%s", logbuf);
        }

    }

    fclose(file);
    free(buffer);

    if (written >= TOTAL_SIZE) {
        LOG("File benchmark completed: %lu bytes written successfully\n", written);
    } else {
        LOG("File benchmark stopped early: %lu bytes written\n", written);
    }
}

//=============================================================================================
//=============================================================================================
void updateSDInfo()
{
    if ( !s_sd_initialized) return;

    /* Get volume information and free clusters of sdcard */
    FATFS *fs;
    DWORD free_clust ;
    auto res = f_getfree("/sdcard/", &free_clust, &fs);
    if (res == 0 ) 
    {
        DWORD free_sect = free_clust * fs->csize;
        DWORD tot_sect = fs->n_fatent * fs->csize;

        SDFreeSpaceGB16 = free_sect / 2 / 1024 / (1024/16);
        SDTotalSpaceGB16 = tot_sect / 2 / 1024 / (1024/16);
	}
}

static bool init_sd()
{
    if (s_sd_initialized) return true;

    SDTotalSpaceGB16 = 0;
    SDFreeSpaceGB16 = 0;

#ifdef SD_CARD_MMC
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 2,
        .allocation_unit_size = 0,
        .disk_status_check_enable = false,
        .use_one_fat = false };

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    // By default, SD card frequency is initialized to SDMMC_FREQ_DEFAULT (20MHz)
    // For setting a specific frequency, use host.max_freq_khz (range 400kHz - 20MHz for SDSPI)
    // Example: for fixed frequency of 10MHz, use host.max_freq_khz = 10000;    
    //host.max_freq_khz = SDMMC_FREQ_PROBING;
    host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
    host.flags = SDMMC_HOST_FLAG_1BIT;

