RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            size_t dataAvail = s_sd_slow_buffer->size();
            xSemaphoreGive(s_sd_slow_buffer_mux);

            //consume all data
            while ( true )
            {
                if ( lookForFrameStart )
                {
                    if ( findFrameStart( s_sd_slow_buffer, offset, dataAvail ))
                    {
                        lookForFrameStart = false;
                        //offset points to FF D8 FF
                        frameStartOffset = offset;
                    }
                    else
                    {
                        if ( offset > 150*1024)
                        {
                            //something wrong
                            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                            s_sd_slow_buffer->skip(offset);
                            xSemaphoreGive(s_sd_slow_buffer_mux);
                            offset = 0;
                            s_stats.sd_drops++;
                            LOG("Unable to find frame start\n");
                        }
                        break;
                    }
                }

                //next frame start
                if ( findFrameStart( s_sd_slow_buffer, offset, dataAvail ))
                {
#ifdef TEST_AVI_FRAMES                    
                    uint16_t fc = s_sd_slow_buffer->peek(offset + 15);
                    fc <<= 8;
                    fc |=  s_sd_slow_buffer->peek(offset + 14);

                    static uint16_t prevFrameCounter;
                    if (prevFrameCounter+1 !=fc )
                    {
                        LOG("Frame: %d+1 != %d\n", prevFrameCounter, fc);
                    } 
                    prevFrameCounter = fc;
#endif
                    lookForFrameStart = true;
                    //offset points to FF D8 FF
                    //exclude zero patern
                    offset-= MJPEG_PATTERN_SIZE;
                    frameCnt++;

                    //save data from frameStartOffset to offset
                    if ( frameStartOffset > 0 )
                    {
                        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                        s_sd_slow_buffer->skip(frameStartOffset);
                        xSemaphoreGive(s_sd_slow_buffer_mux);
                    }

                    size_t jpegSize = offset - frameStartOffset; 

                    uint16_t filler = (4 - (jpegSize & 0x3)) & 0x3; 
                    size_t jpegSize1 = jpegSize + filler;

                    // add avi frame header
                    uint8_t buf[8];
                    memcpy(buf, dcBuf, 4); 
                    memcpy(&buf[4], &jpegSize1, 4);
                    Circular_Buffer temp(buf, 8, 8);
                    storeBuffer( fd, 8, &temp, NULL, sd_write_block, blockSize, aviFileSize, done, error);
                    if (done) break;

                    //store jpeg
                    storeBuffer( fd, jpegSize, s_sd_slow_buffer, s_sd_slow_buffer_mux, sd_write_block, blockSize, aviFileSize, done, error);
                    dataAvail -= offset;
                    offset = 0;
                    if (done) break;

                    //store filler
                    memset(buf, 0, 4); 
                    Circular_Buffer temp1(buf, 4, 4);
                    storeBuffer( fd, filler, &temp1, NULL, sd_write_block, blockSize, aviFileSize, done, error);

                    buildAviIdx(jpegSize1); // save avi index for frame

                    if (frameCnt == (DVR_MAX_FRAMES-1))
                    {
                        break;
                    }
                }
                else
                {
                    if ( (offset - frameStartOffset) > 150*1024)
                    {
                        //something wrong
                        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                        s_sd_slow_buffer->skip(offset);
                        xSemaphoreGive(s_sd_slow_buffer_mux);
                        offset = 0;
                        lookForFrameStart = true;
                        s_stats.sd_drops++;
                        LOG("Unable to find frame end\n");
                    }
                    break;
                }
            }

            if (frameCnt == (DVR_MAX_FRAMES-1))
            {
                LOG("Max frames count reached: %d. Restarting session\n", frameCnt);
                break;
            }

            if (aviFileSize > 50 * 1024 * 1024)
            {
                LOG("Max file size reached: %d. Restarting session\n", aviFileSize);
                break;
            }

            if (done) break;
        }
        
        if (!error)
        {
            // save avi index
            finalizeAviIndex(frameCnt);

            while(true)
            {
                size_t sz = writeAviIndex(sd_write_block + blockSize, SD_WRITE_BLOCK_SIZE - blockSize);
                blockSize += sz;
                if ( (blockSize == SD_WRITE_BLOCK_SIZE) || (sz == 0)) //flush block or write leftover
                {
                    if (write(fd, sd_write_block, blockSize) < 0 )
                    {
                        LOG("Error while writing! Stopping session\n");
                        done = true;
                        error = true;
                        SDError = true;
                        break;
                    }
                    blockSize = 0;
                }
                
                if ( sz == 0)
                {
                    break;
                }
            }

            // save avi header at start of file
            buildAviHdr( fps, frameWidth, frameHeight, frameCnt );

            lseek(fd, 0, SEEK_SET); // start of file
            write(fd, aviHeader, AVI_HEADER_LEN); 
            fsync(fd);
            close(fd);

            updateSDInfo();
        }
        else
        {
            s_air_record = false;
            //shutdown_sd();
        }
    }
}


#endif


//=============================================================================================
//=============================================================================================
//this will move data from the fast queue to the slow queue
static void sd_enqueue_proc(void*)
{
    while (true)
    {
        if (!s_air_record)
        {
            //vTaskDelay(1000 / portTICK_PERIOD_MS);
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification
            continue;
        }

        xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
        s_sd_fast_buffer.clear();

#ifdef PROFILE_CAMERA_DATA    
        s_profiler.set(PF_CAMERA_SD_FAST_BUF, 0);
#endif
        xSemaphoreGive(s_sd_fast_buffer_mux);

        while (true)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            size_t size = s_sd_fast_buffer.size();
            if (size == 0)
            {
                xSemaphoreGive(s_sd_fast_buffer_mux);
                continue; //no data? wait some more
            }

