RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    packet.stats.wifi_queue_min = s_min_wlan_outgoing_queue_usage_seen;
    packet.stats.wifi_queue_max = s_max_wlan_outgoing_queue_usage;
    packet.stats.air_record_state = s_air_record ? 1 : 0;

    packet.stats.wifi_ovf = 0;
    if ( s_wifi_ovf_time > 0 )
    {
        int64_t t = esp_timer_get_time();
        t -= s_wifi_ovf_time;
        if ( t < 1000000 )
        {
            packet.stats.wifi_ovf = 1;
        }
        else
        {
            s_wifi_ovf_time = 0;
        }
    }
    
    packet.stats.SDFreeSpaceGB16 = SDFreeSpaceGB16;
    packet.stats.SDTotalSpaceGB16 = SDTotalSpaceGB16;
    packet.stats.curr_quality = s_quality;

    packet.stats.temperature = (uint8_t)(s_camera_temperature + 0.5f);
    packet.stats.overheatTrottling = 0;

    if ( s_last_stats.RCPeriodMaxMS < 0 )
    {
        packet.stats.RCPeriodMax = 0;
    }
    else if ( s_last_stats.RCPeriodMaxMS == 0 )
    {
        packet.stats.RCPeriodMax = 1;
    }
    else if ( s_last_stats.RCPeriodMaxMS <= 100 )
    {
        packet.stats.RCPeriodMax = s_last_stats.RCPeriodMaxMS;
    }
    else 
    {
        //s_last_stats.RCPeriodMaxMS can not be > 1000
        //1000/10 + 101 < 255
        packet.stats.RCPeriodMax = s_last_stats.RCPeriodMaxMS / 10 + 101;   
    }

#ifdef SENSOR_OV5640
    packet.stats.isOV5640 = 1;
#else
    packet.stats.isOV5640 = 0;
#endif    

    packet.stats.outPacketRate = s_last_stats.outPacketCounter;
    packet.stats.inPacketRate = s_last_stats.inPacketCounter;
    packet.stats.inRejectedPacketRate = s_last_stats.inRejectedPacketCounter;
    packet.stats.rssiDbm = s_last_stats.rssiDbm;
    packet.stats.noiseFloorDbm = s_last_stats.noiseFloorDbm;
    packet.stats.captureFPS = s_actual_capture_fps;
    packet.stats.cam_frame_size_min = s_last_stats.camera_frame_size_min;
    packet.stats.cam_frame_size_max = s_last_stats.camera_frame_size_max;
    packet.stats.cam_ovf_count = cam_ovf_count;
    packet.stats.inMavlinkRate = s_last_stats.in_telemetry_data;
    packet.stats.outMavlinkRate = s_last_stats.out_telemetry_data;

    packet.stats.suspended = s_camera_stopped != 0;

    packet.crc = crc8(0, &packet, sizeof(Air2Ground_OSD_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_config_packet()
{
    uint32_t size;
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true, &size);
    if( !packet_data )
    {
        LOG("no data buf!\n");
        return;
    }

    Air2Ground_Config_Packet& packet = *(Air2Ground_Config_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Config;
    packet.size = sizeof(Air2Ground_Config_Packet);
    packet.dataChannel = s_ground2air_config_packet.dataChannel;
    packet.camera = s_ground2air_config_packet.camera;
    packet.misc = s_ground2air_config_packet.misc;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;

    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Config_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

constexpr size_t MAX_VIDEO_DATA_PAYLOAD_SIZE = AIR2GROUND_MAX_MTU - sizeof(Air2Ground_Video_Packet);

static const int WifiRateBandwidth[] = 
{
    2*1024*125, // 0 - RATE_B_2M_CCK,
    2*1024*125, // 1 - RATE_B_2M_CCK_S,
    5*1024*125, // 2 - RATE_B_5_5M_CCK,
    5*1024*125, // 3 - RATE_B_5_5M_CCK_S,
    11*1024*125, // 4 - RATE_B_11M_CCK,
    11*1024*125, // 5 - RATE_B_11M_CCK_S,

    6*1024*125, // 6 - RATE_G_6M_ODFM,
    9*1024*125, // 7 - RATE_G_9M_ODFM,
    12*1024*125, // 8 - RATE_G_12M_ODFM,
    18*1024*125, // 9 - RATE_G_18M_ODFM,
    24*1024*125,  // 10 - RATE_G_24M_ODFM,
    36*1024*125,  // 11 - RATE_G_36M_ODFM,
    48*1024*125,  // 12 - RATE_G_48M_ODFM,
    54*1024*125,  // 13 - RATE_G_54M_ODFM,

    6*1024*125, // 14 - RATE_N_6_5M_MCS0,
    7*1024*125, // 15 - RATE_N_7_2M_MCS0_S,
    13*1024*125, // 16 - RATE_N_13M_MCS1,
    14*1024*125, // 17 - RATE_N_14_4M_MCS1_S,
    19*1024*125, // 18 - RATE_N_19_5M_MCS2,
    21*1024*125, // 19 - RATE_N_21_7M_MCS2_S,
    26*1024*125, // 20 - RATE_N_26M_MCS3,
    28*1024*125, // 21 - RATE_N_28_9M_MCS3_S,
    39*1024*125, // 22 - RATE_N_39M_MCS4,
    43*1024*125, // 23 - RATE_N_43_3M_MCS4_S,
    52*1024*125, // 24 - RATE_N_52M_MCS5,
    57*1024*125, // 25 - RATE_N_57_8M_MCS5_S,
    58*1024*125, // 26 - RATE_N_58M_MCS6,
    65*1024*125, // 27 - RATE_N_65M_MCS6_S,
    65*1024*125, // 28 - RATE_N_65M_MCS7,
    72*1024*125 // 29 - RATE_N_72M_MCS7_S,
};


IRAM_ATTR int getBandwidthForRate(WIFI_Rate rate)
{
    return WifiRateBandwidth[(int)rate];
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR int calculateAdaptiveQualityValue()
{
    int quality1 = (int)(8 + (63-8) * ( 1 - s_quality_framesize_K1 * s_quality_framesize_K2 * s_quality_framesize_K3));
    if ( quality1 < 8) quality1 = 8;
    if ( quality1 > 63) quality1 = 63;

    //recode due to non-linear frame size changes depending on quality
    //from 8 to 19 frame size decreases by half, from 20 to 63 frame size decreases by half
    //y=(x-8)^2.3/185 + 8
    static const uint8_t recode[64-8] = { 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 12, 12, 13, 13, 14, 15, 15, 16, 17, 18, 19, 20, 20, 21, 23, 24, 25, 26, 27, 29, 30, 31, 33, 34, 36, 37, 39, 41, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 63};

    return recode[quality1-8];
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR bool isHQDVRMode()
{
    return s_ground2air_config_packet2.camera.resolution == Resolution::HD;
}

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR void recalculateFrameSizeQualityK(int video_full_frame_size)
{
    if ( video_full_frame_size > s_max_frame_size )
    {
        s_max_frame_size = video_full_frame_size;
    }
    if ( video_full_frame_size == 0 ) return;

    int fps = s_actual_capture_fps_expected > 1 ? s_actual_capture_fps_expected : 10;
    if (s_actual_capture_fps_expected < 15 ) s_actual_capture_fps_expected++;  //under low FPS mesaurements fluctuate. Enforce lower estimation.

    //K1 - wifi bandwidth
    //data rate available with current wifi rate
    int rateBandwidth = getBandwidthForRate(s_wlan_rate);

