RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
Proper solution - jpeg chunks parsing - is possible but waste of CPU resources, because jpeg has to be processed byte-by-byte.

We apply very fast workaround instead.

We always zero first 16 bytes in the DMA buffer after processing.

ov2640: instead of receiving garbage block, we receive block with 16 zeros at start. This way we know that the whole buffer has to be skipped; 
jpeg is terminated already in the previous block. We waste only few bytes at the end of the block, which are filled by zeros.

ov5640: we are able to finish frame at the first completely zero block,
and even on the block wich has 16 zeros at end
*/

//=============================================================================================
//=============================================================================================
IRAM_ATTR size_t camera_data_available(void * cam_obj,const uint8_t* data, size_t count, bool last)
{
    if ( !s_initialized ) return count;

#ifdef PROFILE_CAMERA_DATA    
    s_profiler.set(PF_CAMERA_DATA, 1);
#endif

    size_t stride = ((cam_obj_t *)cam_obj)->dma_bytes_per_item;

    if ( getOVFFlagAndReset() )
    {
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_OVF);
#endif
        s_quality_framesize_K3 = 0.05;
        cam_ovf_count++;
        s_stats.video_frames_expected++;
        applyAdaptiveQuality();
    }

    if (data == nullptr) //start frame
    {
        if (  !s_video_frame_started )
        {
            //limit fps
            int64_t n = esp_timer_get_time();
            int64_t send_dt = n - s_video_last_sent_tp;
            if (send_dt >= s_video_target_frame_dt)
            {
                s_video_last_sent_tp = n;

                s_video_frame_started = true;

                s_video_frame_data_size = 0;
                s_video_part_index = 0;

                s_video_full_frame_size = 0;
                
                s_lastByte_ff = false;
            }

            if ( !isHQDVRMode() || (s_wlan_outgoing_queue_usage < 5))
            {
                s_encoder_output_ovf_flag = false;
            }
        }
    }
    else 
    {
        s_fec_encoder.lock();

#if defined(USE_MOCK_CAMERA) || defined(BOARD_XIAOS3SENSE) || defined(BOARD_ESP32C5)
        //sample offset: 0, stride: 1
        const uint8_t* src = (const uint8_t*)data;
#elif defined(BOARD_ESP32CAM)
        //ESP32 - sample offset: 2, stride: 4
        const uint8_t* src = (const uint8_t*)data + 2;  // jump to the sample1 of DMA element
#endif
        uint8_t* clrSrc = (uint8_t*)src;

        if ( s_video_frame_started && (s_video_full_frame_size == 0) )
        {
            if (src[0] != 0xff || src[stride] != 0xd8)
            {
                //broken frame data, no start marker
                //we probably missed the start of the frame. Have to skip it.
                cam_ovf_count++; 
                s_stats.video_frames_expected++;
                s_video_frame_started = false;
            }
            else
            {
#ifdef DVR_SUPPORT
                if (s_air_record)
                {
                    add_to_sd_fast_buffer(clrSrc, 0, true);
                }
#endif
            }
        }

        if (s_video_frame_started)
        {
            count /= stride;

//do not perform additional frame end check on C5. Frame boundary is precise on C5.
#if !defined(BOARD_ESP32C5)

            //check if we missed last block due to VSYNK near the end of prev (last) block
            // if block starts with 16 zero bytes - it is either not filled at all (ov2640)
            //or is fully filled with zeros(ov5640)
            const uint8_t* src1 = src;
            int i;
            for ( i = 0; i < 16; i++ )
            {
                if ( *src1 != 0 ) break;
                src1 += stride;
            }
            
            if ( i == 16 ) 
            {
                //we missed last block, this is next block after last
                //the whole block should be skipped
                last = true;
                count = 0;
            }
            else 
            {
#if defined(BOARD_XIAOS3SENSE)
                //ov5640: check if 16 bytes at the end of the block are zero
                const uint32_t* pTail = (const uint32_t*)(&(src[count - 16]));
                if ( (pTail[0] == 0 ) && ( pTail[1] == 0 ) && ( pTail[2] == 0 ) && ( pTail[3] == 0 ) )
                {
                    //zeros at the end - block has to contain end marker
                    last = true;
                }
#endif

                if (last) //find the end marker for JPEG. Data after that can be discarded
                {
                    //edge case - 0xFF at the end of prev block, 0xD9 on the start of this
                    if ( s_lastByte_ff && (*src == 0xD9))
                    {
                        count = 1;
                    }
                    else
                    {
                        //search from the start of the block
                        //tail of the block can contain end markers in garbage
                        const uint8_t* dptr = src;
                        const uint8_t* dptrEnd = src + (count - 2) * stride;
                        while (dptr <= dptrEnd)
                        {
                            if (dptr[0] == 0xFF && dptr[stride] == 0xD9)
                            {
                                count = (dptr - src) / stride + 2; //to include the 0xFFD9
                                if ((count & 0x1FF) == 0)
                                    count += 1; 
                                if ((count % 100) == 0)
                                    count += 1;
                                break;
                            }
                            dptr += stride;
                        }
                    }
                }
            }
#endif //BOARD_ESP32C5

            s_lastByte_ff = count > 0 ? src[count-1] == 0xFF : false;
            while (count > 0)
            {
                //fill the buffer
                uint32_t current_packet_size;
                uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true, &current_packet_size);
                uint8_t* start_ptr = packet_data + sizeof(Air2Ground_Video_Packet) + s_video_frame_data_size;
                uint8_t* ptr = start_ptr;
                size_t c = std::min((size_t)( current_packet_size - sizeof(Air2Ground_Video_Packet) - s_video_frame_data_size), count);

