RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                }

                s_video_frame_index++;
            }
        }

//do no clear mock camera data
//do not clear buffer on C5. Frame detection is different onf C5.
#if !defined(USE_MOCK_CAMERA) && !defined(BOARD_ESP32C5)
        //zero start of the DMA block
        for ( int i = 0; i < 16; i++ )
        {
            *clrSrc = 0;
            clrSrc += stride;
        }
#endif
        s_fec_encoder.unlock();
    }

#ifdef PROFILE_CAMERA_DATA    
    s_profiler.set(PF_CAMERA_DATA, 0);
#endif

    return count;
}

//=============================================================================================
//=============================================================================================
static void init_camera()
{
    printf("Init camera...\n");

    camera_config_t config = {
        .pin_pwdn = PWDN_GPIO_NUM,
        .pin_reset = RESET_GPIO_NUM,
        .pin_xclk = XCLK_GPIO_NUM,
        .pin_sccb_sda = SIOD_GPIO_NUM,
        .pin_sccb_scl = SIOC_GPIO_NUM,
        .pin_d7 = Y9_GPIO_NUM,
        .pin_d6 = Y8_GPIO_NUM,
        .pin_d5 = Y7_GPIO_NUM,
        .pin_d4 = Y6_GPIO_NUM,
        .pin_d3 = Y5_GPIO_NUM,
        .pin_d2 = Y4_GPIO_NUM,
        .pin_d1 = Y3_GPIO_NUM,
        .pin_d0 = Y2_GPIO_NUM,
        .pin_vsync = VSYNC_GPIO_NUM,
        .pin_href = HREF_GPIO_NUM,
        .pin_pclk = PCLK_GPIO_NUM,
#ifdef SENSOR_OV5640
        .xclk_freq_hz = 20000000,
#else
        .xclk_freq_hz = 12000000,  //real frequency will be 80Mhz/6 = 13,333Mhz and we use clk2x
#endif
        .ledc_timer = LEDC_TIMER_0,
        .ledc_channel = LEDC_CHANNEL_0,
        .pixel_format = PIXFORMAT_JPEG,
        .frame_size = FRAMESIZE_SVGA,
        .jpeg_quality = 63,  //start from lowest quality to decrease pressure at startup
        .fb_count = 2,
        .fb_location = CAMERA_FB_IN_DRAM,
        .grab_mode = CAMERA_GRAB_LATEST,
        .sccb_i2c_port = I2C_NUM_0,
        .data_available_callback = camera_data_available };

    // camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK)
    {
        LOG("Camera init failed with error 0x%x", err);
        return;
    }
}

//#define SHOW_CPU_USAGE

//=============================================================================================
//=============================================================================================
static void print_cpu_usage()
{
#ifdef SHOW_CPU_USAGE
    TaskStatus_t* pxTaskStatusArray;
    volatile UBaseType_t uxArraySize, x;
    uint32_t ulTotalRunTime, ulStatsAsPercentage;

    // Take a snapshot of the number of tasks in case it changes while this
    // function is executing.
    uxArraySize = uxTaskGetNumberOfTasks();
    //LOG("%u tasks\n", uxArraySize);

    // Allocate a TaskStatus_t structure for each task.  An array could be
    // allocated statically at compile time.
    pxTaskStatusArray = (TaskStatus_t*)heap_caps_malloc(uxArraySize * sizeof(TaskStatus_t), MALLOC_CAP_SPIRAM);

    if (pxTaskStatusArray != NULL)
    {
        // Generate raw status information about each task.
        uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
        //LOG("%u total usage\n", ulTotalRunTime);

        // For percentage calculations.
        ulTotalRunTime /= 100UL;

        // Avoid divide by zero errors.
        if (ulTotalRunTime > 0)
        {
            // For each populated position in the pxTaskStatusArray array,
            // format the raw data as human readable ASCII data
            for (x = 0; x < uxArraySize; x++)
            {
                // What percentage of the total run time has the task used?
                // This will always be rounded down to the nearest integer.
                // ulTotalRunTimeDiv100 has already been divided by 100.
                ulStatsAsPercentage = pxTaskStatusArray[x].ulRunTimeCounter / ulTotalRunTime;

                if (ulStatsAsPercentage > 0UL)
                {
                    LOG("%s\t\t%u\t\t%u%%\r\n", pxTaskStatusArray[x].pcTaskName, pxTaskStatusArray[x].ulRunTimeCounter, ulStatsAsPercentage);
                }
                else
                {
                    // If the percentage is zero here then the task has
                    // consumed less than 1% of the total run time.
                    LOG("%s\t\t%u\t\t<1%%\r\n", pxTaskStatusArray[x].pcTaskName, pxTaskStatusArray[x].ulRunTimeCounter);
                }
            }
        }

        // The array is no longer needed, free the memory it consumes.
        free(pxTaskStatusArray);
    }
#endif
}

//=============================================================================================
//=============================================================================================
uint16_t generateDeviceId() 
{
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA); // Read base MAC address
    uint16_t id = 0;

    // Fold MAC address into 16 bits
    id ^= (mac[0] << 8) | mac[1];
    id ^= (mac[2] << 8) | mac[3];
    id ^= (mac[4] << 8) | mac[5];

    return id;
}
//=============================================================================================
//=============================================================================================
void readConfig()
{
    s_air_device_id = (uint16_t)nvs_args_read( "deviceId", 0 );
    if( s_air_device_id == 0 )
    {
        s_air_device_id = generateDeviceId();
        nvs_args_set("deviceId", s_air_device_id);
    }
    LOG("Air Device ID: 0x%04x\n", (int)s_air_device_id);

    s_ground2air_config_packet.dataChannel.wifi_channel = (uint16_t)nvs_args_read( "channel", DEFAULT_WIFI_CHANNEL );
    if((s_ground2air_config_packet.dataChannel.wifi_channel < 1)  || (s_ground2air_config_packet.dataChannel.wifi_channel > 13))
    {
        s_ground2air_config_packet.dataChannel.wifi_channel = DEFAULT_WIFI_CHANNEL;
        nvs_args_set("channel", s_ground2air_config_packet.dataChannel.wifi_channel);
    }

    s_ground2air_config_packet.dataChannel.wifi_rate = (WIFI_Rate)nvs_args_read( "rate", -1 );
    if( s_ground2air_config_packet.dataChannel.wifi_rate > WIFI_Rate::RATE_N_72M_MCS7_S )
    {
        s_ground2air_config_packet.dataChannel.wifi_rate = DEFAULT_WIFI_RATE;
        nvs_args_set("rate", (uint32_t)s_ground2air_config_packet.dataChannel.wifi_rate);
    }

    s_ground2air_config_packet.dataChannel.fec_codec_k = (uint8_t)nvs_args_read( "fec_k", 0 );
    s_ground2air_config_packet.dataChannel.fec_codec_n = (uint8_t)nvs_args_read( "fec_n", 0 );

    if( 
        (s_ground2air_config_packet.dataChannel.fec_codec_k == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k > 12) || 
        (s_ground2air_config_packet.dataChannel.fec_codec_n == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_n > 12) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k >= s_ground2air_config_packet.dataChannel.fec_codec_n) 
        )
    {
        s_ground2air_config_packet.dataChannel.fec_codec_k = 6;
        s_ground2air_config_packet.dataChannel.fec_codec_n = 8;
        nvs_args_set("fec_k", s_ground2air_config_packet.dataChannel.fec_codec_k);
        nvs_args_set("fec_n", s_ground2air_config_packet.dataChannel.fec_codec_n);
    }

    s_ground2air_config_packet.dataChannel.fec_codec_mtu = (uint8_t)nvs_args_read( "fec_codec_mtu", AIR2GROUND_MAX_MTU );
    if ( 
        ( s_ground2air_config_packet.dataChannel.fec_codec_mtu < AIR2GROUND_MIN_MTU ) ||
        ( s_ground2air_config_packet.dataChannel.fec_codec_mtu > AIR2GROUND_MAX_MTU ) 
    )
    {
        s_ground2air_config_packet.dataChannel.fec_codec_mtu = AIR2GROUND_MAX_MTU;
    }

    s_ground2air_config_packet.camera.resolution = (Resolution)nvs_args_read("resolution", (uint32_t)Resolution::SVGA);
    if ( s_ground2air_config_packet.camera.resolution > Resolution::HD  )
    {
        s_ground2air_config_packet.camera.resolution = Resolution::SVGA;
        nvs_args_set("resolution", (uint32_t)s_ground2air_config_packet.camera.resolution);
    }

    s_ground2air_config_packet.camera.brightness = (int8_t)nvs_args_read("brightness", 10);
    if ( ( s_ground2air_config_packet.camera.brightness < -2 ) || ( s_ground2air_config_packet.camera.brightness > 2 ) )
    {
        s_ground2air_config_packet.camera.brightness = 0;
        nvs_args_set("brightness", s_ground2air_config_packet.camera.brightness);
    }

    s_ground2air_config_packet.camera.contrast = (int8_t)nvs_args_read("contrast", 10);
    if ((s_ground2air_config_packet.camera.contrast < -2) || (s_ground2air_config_packet.camera.contrast > 2))
    {
        s_ground2air_config_packet.camera.contrast = 0; // Default contrast
        nvs_args_set("contrast", s_ground2air_config_packet.camera.contrast);
    }

    s_ground2air_config_packet.camera.saturation = (int8_t)nvs_args_read("saturation", 10);
    if ((s_ground2air_config_packet.camera.saturation < -2) || (s_ground2air_config_packet.camera.saturation > 2))
    {
        s_ground2air_config_packet.camera.saturation = 1; // Default saturation
        nvs_args_set("saturation", s_ground2air_config_packet.camera.saturation);
    }

