RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
            s_stats.wlan_error_count += s_fec_wlan_error_count;
            s_fec_wlan_error_count = 0;

            if (s_uart_verbose > 0 )
            {
                //LOG is busy wait for ~11ms
                //ESP_LOGI is task yeld for ~13ms
                //LOG("WLAN S: %d, R: %d, E: %d, F: %d, D: %d, %%: %d...%d || FPS: %d(%d), D: %d || SD D: %d, E: %d || TLM IN: %d OUT: %d\nSK1: %d SK2: %d, SK3: %d, Q: %d s: %d ovf:%d || sbg: %d || AIR: 0x%04x || GS: 0x%04x\n ",
                ESP_LOGI( "Main", "WLAN S: %d, R: %d, E: %u, F: %u, D: %u, %%: %d...%d || FPS: %d(%d), D: %u || SD D: %u, E: %u || TLM IN: %u OUT: %u\nSK1: %d SK2: %d, SK3: %d, Q: %d s: %u ovf:%d || sbg: %d || AIR: 0x%04x || GS: 0x%04x\n ",
                    (int)pk, /*s_stats.wlan_data_sent,*/ (int)pk2, /*s_stats.wlan_data_received,*/ s_stats.wlan_error_count, s_stats.fec_spin_count,
                    s_stats.wlan_received_packets_dropped, s_min_wlan_outgoing_queue_usage_seen, s_max_wlan_outgoing_queue_usage, 
                    s_actual_capture_fps, s_actual_capture_fps_expected, (unsigned int)s_stats.video_data, (unsigned int)s_stats.sd_data, (unsigned int)s_stats.sd_drops,
                    (unsigned int)s_stats.in_telemetry_data, (unsigned int)s_stats.out_telemetry_data,
                    (int)(s_quality_framesize_K1*100),  (int)(s_quality_framesize_K2*100), (int)(s_quality_framesize_K3*100),
                    s_quality, (unsigned int)((s_stats.camera_frame_size_min + s_stats.camera_frame_size_max)/2), cam_ovf_count, (int)s_dbg,
                    s_air_device_id, s_connected_gs_device_id); 
                print_cpu_usage();
            }

            s_max_frame_size = 0;
            s_dbg = 0;

            if ( s_stats.fec_spin_count > 0 )
            {
                s_wifi_ovf_time = esp_timer_get_time();
            }

            s_last_stats = s_stats;
            s_stats = Stats();

            temperature_sensor_read(&s_camera_temperature);

            if ( s_camera_stopped_requested != s_camera_stopped )
            {
                s_camera_stopped = s_camera_stopped_requested;
                if ( s_camera_stopped )
                {
                    LOG("Camera stopped\n");
#if !defined(USE_MOCK_CAMERA)
                    esp_camera_deinit();
#endif                    
                }
                else
                {
                    LOG("Camera started\n");
#if !defined(USE_MOCK_CAMERA)
                    init_camera();
#endif                    
                }
            }
        }

        dt = millis() - s_last_osd_packet_tp;
        if ( dt > 200 ) 
        {
            s_last_osd_packet_tp = millis();
            
            if ( s_camera_stopped )
            {
                s_fec_encoder.lock();

                if ( !g_osd.isLocked() && (g_osd.isChanged() || (s_osdUpdateCounter == 15)) )
                {
                    send_air2ground_osd_packet();
                    s_osdUpdateCounter = 0;
                }
                else
                {
                    s_osdUpdateCounter++;
                }
                
                s_fec_encoder.unlock();
            }
        }

        if ( s_accept_connection_timeout_ms != 0 ) 
        {
            if ( s_accept_connection_timeout_ms < millis() )
            {
                unpairGS();
            }
        }

        vTaskDelay(10 / portTICK_PERIOD_MS);  //portTICK_PERIOD_MS = 10. Main task should call vTaskDelay(1) oherwise WDT will trigger in the idle task.

        //esp_task_wdt_reset();

        checkButton();

        update_status_led();

#ifdef ENABLE_PROFILER
        if ( s_profiler.full() || s_profiler.timedOut() )
        {
            LOG("Profiler stopped!\n");
            s_profiler.stop();
            s_profiler.save();
            s_profiler.clear();
        } 
#endif

/*
#ifdef UART_MAVLINK
        xSemaphoreTake(s_serial_mux, portMAX_DELAY);

        if ( s_video_frame_data_size == 0 &&  s_video_part_index == 0 )
        {
            while ( true )
            {
                size_t rs = 0;

                LOG("%d\n", rs);

                //if (rs >= MAX_TELEMETRY_PAYLOAD_SIZE) //TODO: or rs>0 and >agregation time
                if (rs >= 1) //TODO: or rs>0 and >agregation time
                {
                    if (!send_air2ground_data_packet()) break;
                }
                else
                {
                    break;
                }
            }
        }

        xSemaphoreGive(s_serial_mux);
#endif
*/

#ifdef UART_MSP_OSD
        //the msp.loop() should be called every ~10ms
        //115200 BAUD is 11520 bytes per second or 115 bytes per 10 ms
        //with UART RX buffer of 512 we are save with periods 10...40ms
        g_msp.loop();
#endif

        if ((s_restart_time!=0) && ( esp_timer_get_time()>s_restart_time))
        {
            esp_restart();
        }

#ifdef USE_MOCK_CAMERA
        mock_camera_process();
#endif


    }

}

/*
Air receive:
1) packet_received_cb()- called by Wifi library when wifi packet is received
  - feeds data to s_fec_decoder.decode_data(). No data type checking at all.

2) s_fec_decoder.decode_data()
 - allocates item in m_decoder.packet_pool
 - concatenates small packets until mtu size (because wifi packets may be broken to smaller parts by wifi layer)
 - enquees packets into m_decoder.packet_queue

3) decoder_task_proc()  
 - retrives item from m_decoder.packet_queue
 - inserts either in m_decoder.block_packets or m_decoder.block_fec_packets
 - inserts into s_wlan_incoming_queue either received or restored packets
 - signals s_wifi_rx_task

4) s_wifi_rx_task
  - parses packets: Ground2Air_Header::Type::Config, Ground2Air_Header::Type::Data
 

Air send:
1) camera_data_available callback from camera library
 - send_air2ground_video_packet() - passes Air2Ground_Video_Packet to s_fec_encode.
 - flush_encode_packet() - concatenates data until mtu size and passes to m_encoder.packet_queue
 
 2) encoder_task_proc()
  - gathers packets in m_encoder.block_packets
  - calls fec_encode(()
  - add_to_wlan_outgoing_queue() - places encoded packets into s_wlan_outgoing_queue

3) wifi_tx_proc
 - reads s_wlan_outgoing_queue
 - calls esp_wifi_80211_tx() 

*/
